#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/a68f01fb-8443-4054-92ad-f8c835da021d/terraform-bin plan -out=tfplan -no-color
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.data.aws_partition.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.rds_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS PostgreSQL database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "AIDoctors-rds-sg-"
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "AIDoctors-rds-security-group"
        }
      + tags_all               = {
          + "Name" = "AIDoctors-rds-security-group"
        }
      + vpc_id                 = "vpc-05686e7dc52f8f6df"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "us-east-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "PostgreSQL Ingress"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.vpc.aws_db_subnet_group.database[0] will be updated in-place
  ~ resource "aws_db_subnet_group" "database" {
        id                      = "aidoctors-vpc"
        name                    = "aidoctors-vpc"
      ~ tags                    = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-0032386130964171e"
      ~ tags                   = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all               = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (6 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-083c0db3e1395fded"
      ~ tags                   = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all               = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-0fc63c4d494374dd6"
        name                   = "default"
      ~ tags                   = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all               = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                       = "eipalloc-030857cf79d386198"
      ~ tags                     = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                 = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (17 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                       = "eipalloc-038f6ff47eba184f5"
      ~ tags                     = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                 = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (17 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-043f4c0120570ae34"
      ~ tags     = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                                 = "nat-0e24a561bd9bff913"
      ~ tags                               = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                           = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[1] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                                 = "nat-060795adfd71d2087"
      ~ tags                               = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                           = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0f5eb680acf65fea3"
      ~ tags             = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all         = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-09431dd1309dfe33a"
      ~ tags             = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all         = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0f7d82a180ace47f4"
      ~ tags             = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all         = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.database[0] will be updated in-place
  ~ resource "aws_subnet" "database" {
        id                                             = "subnet-0bf70d3f2fadcfb41"
      ~ tags                                           = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                                       = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (20 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.database[1] will be updated in-place
  ~ resource "aws_subnet" "database" {
        id                                             = "subnet-07efa2bcb551685bd"
      ~ tags                                           = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                                       = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (20 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-073019d7ba4d1ac80"
      ~ tags                                           = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                                       = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (20 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0c5b5757a4ad55762"
      ~ tags                                           = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                                       = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (20 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-07bf335ed55e1233f"
      ~ tags                                           = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                                       = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (20 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-00181454359ad7fee"
      ~ tags                                           = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                                       = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (20 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-05686e7dc52f8f6df"
      ~ tags                                 = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
      ~ tags_all                             = {
          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"
        }
        # (19 unchanged attributes hidden)
    }

  # module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/rds/instance/AIDoctors-db/postgresql"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "AIDoctors-postgres"
        }
      + tags_all          = {
          + "Name" = "AIDoctors-postgres"
        }
    }

  # module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/rds/instance/AIDoctors-db/upgrade"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "AIDoctors-postgres"
        }
      + tags_all          = {
          + "Name" = "AIDoctors-postgres"
        }
    }

  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AIDoctors-rds-monitoring-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "AIDoctors-postgres"
        }
      + tags_all              = {
          + "Name" = "AIDoctors-postgres"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "AIDoctors-rds-monitoring-role"
    }

  # module.db.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id"                  = "AIDoctors-db"
          + "snapshot_identifier" = null
        }
    }

Plan: 8 to add, 19 to change, 0 to destroy.

Error: only lowercase alphanumeric characters and hyphens allowed in parameter group "name_prefix"

  with module.db.module.db_parameter_group.aws_db_parameter_group.this[0],
  on .terraform/modules/db/modules/db_parameter_group/main.tf line 12, in resource "aws_db_parameter_group" "this":
  12:   name_prefix = local.name_prefix


Error: first character of parameter group "name_prefix" must be a letter

  with module.db.module.db_parameter_group.aws_db_parameter_group.this[0],
  on .terraform/modules/db/modules/db_parameter_group/main.tf line 12, in resource "aws_db_parameter_group" "this":
  12:   name_prefix = local.name_prefix

::debug::Terraform exited with code 1.
::debug::stdout: module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...%0Amodule.db.module.db_instance.data.aws_partition.current: Reading...%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]%0Amodule.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]%0Amodule.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]%0Amodule.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]%0Amodule.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]%0Amodule.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]%0Amodule.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.rds_security_group.aws_security_group.this_name_prefix[0] will be created%0A  + resource "aws_security_group" "this_name_prefix" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for RDS PostgreSQL database"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "AIDoctors-rds-sg-"%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "AIDoctors-rds-security-group"%0A        }%0A      + tags_all               = {%0A          + "Name" = "AIDoctors-rds-security-group"%0A        }%0A      + vpc_id                 = "vpc-05686e7dc52f8f6df"%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "15m"%0A        }%0A    }%0A%0A  # module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created%0A  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow all outbound traffic"%0A      + from_port                = 0%0A      + id                       = (known after apply)%0A      + protocol                 = "-1"%0A      + region                   = "us-east-2"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 0%0A      + type                     = "egress"%0A    }%0A%0A  # module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created%0A  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {%0A      + cidr_blocks              = [%0A          + "10.0.0.0/16",%0A        ]%0A      + description              = "PostgreSQL Ingress"%0A      + from_port                = 5432%0A      + id                       = (known after apply)%0A      + protocol                 = "tcp"%0A      + region                   = "us-east-2"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 5432%0A      + type                     = "ingress"%0A    }%0A%0A  # module.vpc.aws_db_subnet_group.database[0] will be updated in-place%0A  ~ resource "aws_db_subnet_group" "database" {%0A        id                      = "aidoctors-vpc"%0A        name                    = "aidoctors-vpc"%0A      ~ tags                    = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_default_network_acl.this[0] will be updated in-place%0A  ~ resource "aws_default_network_acl" "this" {%0A        id                     = "acl-0032386130964171e"%0A      ~ tags                   = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all               = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (6 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.vpc.aws_default_route_table.default[0] will be updated in-place%0A  ~ resource "aws_default_route_table" "default" {%0A        id                     = "rtb-083c0db3e1395fded"%0A      ~ tags                   = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all               = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (7 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.vpc.aws_default_security_group.this[0] will be updated in-place%0A  ~ resource "aws_default_security_group" "this" {%0A        id                     = "sg-0fc63c4d494374dd6"%0A        name                   = "default"%0A      ~ tags                   = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all               = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_eip.nat[0] will be updated in-place%0A  ~ resource "aws_eip" "nat" {%0A        id                       = "eipalloc-030857cf79d386198"%0A      ~ tags                     = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                 = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (17 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_eip.nat[1] will be updated in-place%0A  ~ resource "aws_eip" "nat" {%0A        id                       = "eipalloc-038f6ff47eba184f5"%0A      ~ tags                     = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                 = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (17 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_internet_gateway.this[0] will be updated in-place%0A  ~ resource "aws_internet_gateway" "this" {%0A        id       = "igw-043f4c0120570ae34"%0A      ~ tags     = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[0] will be updated in-place%0A  ~ resource "aws_nat_gateway" "this" {%0A        id                                 = "nat-0e24a561bd9bff913"%0A      ~ tags                               = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                           = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[1] will be updated in-place%0A  ~ resource "aws_nat_gateway" "this" {%0A        id                                 = "nat-060795adfd71d2087"%0A      ~ tags                               = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                           = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.private[0] will be updated in-place%0A  ~ resource "aws_route_table" "private" {%0A        id               = "rtb-0f5eb680acf65fea3"%0A      ~ tags             = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all         = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.private[1] will be updated in-place%0A  ~ resource "aws_route_table" "private" {%0A        id               = "rtb-09431dd1309dfe33a"%0A      ~ tags             = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all         = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] will be updated in-place%0A  ~ resource "aws_route_table" "public" {%0A        id               = "rtb-0f7d82a180ace47f4"%0A      ~ tags             = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all         = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.database[0] will be updated in-place%0A  ~ resource "aws_subnet" "database" {%0A        id                                             = "subnet-0bf70d3f2fadcfb41"%0A      ~ tags                                           = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                                       = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.database[1] will be updated in-place%0A  ~ resource "aws_subnet" "database" {%0A        id                                             = "subnet-07efa2bcb551685bd"%0A      ~ tags                                           = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                                       = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] will be updated in-place%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-073019d7ba4d1ac80"%0A      ~ tags                                           = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                                       = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] will be updated in-place%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-0c5b5757a4ad55762"%0A      ~ tags                                           = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                                       = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[0] will be updated in-place%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-07bf335ed55e1233f"%0A      ~ tags                                           = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                                       = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] will be updated in-place%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-00181454359ad7fee"%0A      ~ tags                                           = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                                       = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_vpc.this[0] will be updated in-place%0A  ~ resource "aws_vpc" "this" {%0A        id                                   = "vpc-05686e7dc52f8f6df"%0A      ~ tags                                 = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A      ~ tags_all                             = {%0A          ~ "Name" = "AIDoctors VPC" -> "AIDoctors-vpc"%0A        }%0A        # (19 unchanged attributes hidden)%0A    }%0A%0A  # module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"] will be created%0A  + resource "aws_cloudwatch_log_group" "this" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/rds/instance/AIDoctors-db/postgresql"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "AIDoctors-postgres"%0A        }%0A      + tags_all          = {%0A          + "Name" = "AIDoctors-postgres"%0A        }%0A    }%0A%0A  # module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"] will be created%0A  + resource "aws_cloudwatch_log_group" "this" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/rds/instance/AIDoctors-db/upgrade"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "AIDoctors-postgres"%0A        }%0A      + tags_all          = {%0A          + "Name" = "AIDoctors-postgres"%0A        }%0A    }%0A%0A  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created%0A  + resource "aws_iam_role" "enhanced_monitoring" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "monitoring.rds.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "AIDoctors-rds-monitoring-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "Name" = "AIDoctors-postgres"%0A        }%0A      + tags_all              = {%0A          + "Name" = "AIDoctors-postgres"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"%0A      + role       = "AIDoctors-rds-monitoring-role"%0A    }%0A%0A  # module.db.module.db_instance.random_id.snapshot_identifier[0] will be created%0A  + resource "random_id" "snapshot_identifier" {%0A      + b64_std     = (known after apply)%0A      + b64_url     = (known after apply)%0A      + byte_length = 4%0A      + dec         = (known after apply)%0A      + hex         = (known after apply)%0A      + id          = (known after apply)%0A      + keepers     = {%0A          + "id"                  = "AIDoctors-db"%0A          + "snapshot_identifier" = null%0A        }%0A    }%0A%0APlan: 8 to add, 19 to change, 0 to destroy.%0A
::debug::stderr: %0AError: only lowercase alphanumeric characters and hyphens allowed in parameter group "name_prefix"%0A%0A  with module.db.module.db_parameter_group.aws_db_parameter_group.this[0],%0A  on .terraform/modules/db/modules/db_parameter_group/main.tf line 12, in resource "aws_db_parameter_group" "this":%0A  12:   name_prefix = local.name_prefix%0A%0A%0AError: first character of parameter group "name_prefix" must be a letter%0A%0A  with module.db.module.db_parameter_group.aws_db_parameter_group.this[0],%0A  on .terraform/modules/db/modules/db_parameter_group/main.tf line 12, in resource "aws_db_parameter_group" "this":%0A  12:   name_prefix = local.name_prefix%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

*Pusher: @TerryTian21, Action: `pull_request`, Workflow: `Terraform PR Check`*